In [1]:
import main as tools

final_dataFrame = tools.all_data_concat()
print(final_dataFrame.info())

<class 'pandas.core.frame.DataFrame'>
Int64Index: 406761 entries, 0 to 406760
Data columns (total 6 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   乘車日期    406761 non-null  int64
 1   車站代碼    406761 non-null  int64
 2   進站人數    406761 non-null  int64
 3   出站人數    406761 non-null  int64
 4   車站名稱    406761 non-null  object
 5   車站地址    406761 non-null  object
dtypes: int64(4), object(2)
memory usage: 21.7+ MB
None

In [2]:
# groupby
import numpy as np
import pandas as pd

df = pd.DataFrame({'key1':['a', 'a', 'b', 'b', 'a'],
                  'key2':['one', 'two', 'one', 'two', 'one'],
                  'data1': np.random.randn(5),
                  'data2':np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one -0.585742 -0.314292
1    a  two -1.051605  0.191635
2    b  one -1.218191 -0.157666
3    b  two -0.638757 -0.070195
4    a  one -0.726587  0.457801

In [3]:
df.groupby('key1')["data1"].mean()
df.groupby('key1')[["data1","data2"]].mean()
df1 = df.groupby(['key1','key2']).mean()
df1

              data1     data2
key1 key2
a    one  -0.656164  0.071755
     two  -1.051605  0.191635
b    one  -1.218191 -0.157666
     two  -0.638757 -0.070195

In [4]:
df2 = df1.stack() # 變成長的資料
df2.index.names = ['key1','key2','data']
df2

key1  key2  data
a     one   data1   -0.656164
            data2    0.071755
      two   data1   -1.051605
            data2    0.191635
b     one   data1   -1.218191
            data2   -0.157666
      two   data1   -0.638757
            data2   -0.070195
dtype: float64

In [5]:
df3 = df2.unstack(level=["data",'key1']) # 變回寬的資料
df3

data     data1     data2     data1     data2
key1         a         a         b         b
key2
one  -0.656164  0.071755 -1.218191 -0.157666
two  -1.051605  0.191635 -0.638757 -0.070195

In [6]:
df3['data1']

key1         a         b
key2
one  -0.656164 -1.218191
two  -1.051605 -0.638757